examples/Lousiana/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

xmin  0;
xmax  10;
ymin  0;
ymax  10;
zmin  0;
zmax  2;

xcells 128;
ycells 128;
zcells 64; 

vertices
(
    ($xmin $ymin $zmin)        // 0
    ($xmax $ymin $zmin)        // 1
    ($xmax $ymax $zmin)        // 2
    ($xmin $ymax $zmin)        // 3
    ($xmin $ymin $zmax)        // 4
    ($xmax $ymin $zmax)        // 5
    ($xmax $ymax $zmax)        // 6
    ($xmin $ymax $zmax)        // 7 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 10)
);

boundary
(
    bottom
    {
        type            wall;
        faces           ( (0 1 2 3)  ); 
    }
    top
    {
        type            patch;
        faces           ( (4 5 6 7) );
    }
    east
    {
        type            patch;
        faces           ( (1 2 6 5) );
    }
    west
    {
        type            patch;
        faces           ( (0 3 7 4) );
    }
    north
    {
        type            patch;
        faces           ( (2 3 7 6) );
    }
    south
    {
        type            patch;
        faces           ( (1 0 4 5) );
    }

    
);


// ************************************************************************* //
