examples/Lousiana/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (7.220105290936713 0.0 0.0); // check python script
Uinit          (0.0 0.0 0.0); // check python script


dimensions      [0 1 -1 0 0 0 0];

internalField    uniform $Uinlet;

boundaryField
{
    
    top
    {
       //  type            fixedValue;
       // value           uniform $Uinlet;
        type           zeroGradient;  
    }

    wall
    {
        type            noSlip;
    }

   "(north|south|east)"
    {
      //  type            inletOutlet;
      //  inletValue      uniform (0 0 0);
      //  value           uniform (0 0 0);   
        type           zeroGradient;      
    }

    west
    {

    // Mandatory entries (unmodifiable)
    type            atmBoundaryLayerInletVelocity;
    value           uniform (0 0 0);

    // Mandatory (inherited) entries (runtime modifiable)
    flowDir         (1 0 0);
    zDir            (0 0 1);
    Uref            2.57222;
    Zref            9.1;
    z0              uniform 0.5;
    zGround         uniform 0.0;

    // Optional (inherited) entries (unmodifiable)
    kappa           0.41;
    Cmu             0.09;
    initABL         true;
    phi             phi;
    C1              0.0;
    C2              1.0;

    }
    
}


// ************************************************************************* //
