examples/Lousiana/0.orig/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1; 

boundaryField
{
    "(north|south|east|west)"
    {
       // type            fixedFluxPressure;
      //  value           $internalField;   
        type            zeroGradient;
    }

    "(top|bottom)"
    {
      // type            fixedFluxPressure;
      // value           $internalField;
       type            zeroGradient;
    }

    default
    {
       // type            fixedFluxPressure;
       // value           $internalField;
        type            zeroGradient;
    }    
}


// ************************************************************************* //
