examples/Lousiana/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tatm 298.15;    // 25 degrees
Tground 300;   // ground is hotter

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tatm;

boundaryField
{
    
    top
    {
        type            fixedValue;
        value           uniform $Tatm;
    }

    wall
    {
       // type           zeroGradient;
        type            fixedValue;
        value           uniform $Tground;
    }

   "(north|south|east|west)"
    {
        type            zeroGradient;
    }

    default
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
