examples/Lousiana/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    "(north|south|east|west)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    default
    {
        type            zeroGradient;
    }
  
}


// ************************************************************************* //
